Model: "Segmodel"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 256, 256, 1)  0                                            
__________________________________________________________________________________________________
reflection_padding2d_1 (Reflect (None, 262, 262, 1)  0           input_1[0][0]                    
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 256, 256, 32) 1600        reflection_padding2d_1[0][0]     
__________________________________________________________________________________________________
instance_normalization_1 (Insta (None, 256, 256, 32) 64          conv2d_1[0][0]                   
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 256, 256, 32) 0           instance_normalization_1[0][0]   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 128, 128, 64) 18496       activation_1[0][0]               
__________________________________________________________________________________________________
instance_normalization_2 (Insta (None, 128, 128, 64) 128         conv2d_2[0][0]                   
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 128, 128, 64) 0           instance_normalization_2[0][0]   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 64, 64, 128)  73856       activation_2[0][0]               
__________________________________________________________________________________________________
instance_normalization_3 (Insta (None, 64, 64, 128)  256         conv2d_3[0][0]                   
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 64, 64, 128)  0           instance_normalization_3[0][0]   
__________________________________________________________________________________________________
reflection_padding2d_2 (Reflect (None, 66, 66, 128)  0           activation_3[0][0]               
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 64, 64, 128)  147584      reflection_padding2d_2[0][0]     
__________________________________________________________________________________________________
instance_normalization_4 (Insta (None, 64, 64, 128)  256         conv2d_4[0][0]                   
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 64, 64, 128)  0           instance_normalization_4[0][0]   
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 64, 64, 128)  0           activation_4[0][0]               
__________________________________________________________________________________________________
reflection_padding2d_3 (Reflect (None, 66, 66, 128)  0           dropout_1[0][0]                  
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 64, 64, 128)  147584      reflection_padding2d_3[0][0]     
__________________________________________________________________________________________________
instance_normalization_5 (Insta (None, 64, 64, 128)  256         conv2d_5[0][0]                   
__________________________________________________________________________________________________
add_1 (Add)                     (None, 64, 64, 128)  0           instance_normalization_5[0][0]   
                                                                 activation_3[0][0]               
__________________________________________________________________________________________________
reflection_padding2d_4 (Reflect (None, 66, 66, 128)  0           add_1[0][0]                      
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 64, 64, 128)  147584      reflection_padding2d_4[0][0]     
__________________________________________________________________________________________________
instance_normalization_6 (Insta (None, 64, 64, 128)  256         conv2d_6[0][0]                   
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 64, 64, 128)  0           instance_normalization_6[0][0]   
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 64, 64, 128)  0           activation_5[0][0]               
__________________________________________________________________________________________________
reflection_padding2d_5 (Reflect (None, 66, 66, 128)  0           dropout_2[0][0]                  
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 64, 64, 128)  147584      reflection_padding2d_5[0][0]     
__________________________________________________________________________________________________
instance_normalization_7 (Insta (None, 64, 64, 128)  256         conv2d_7[0][0]                   
__________________________________________________________________________________________________
add_2 (Add)                     (None, 64, 64, 128)  0           instance_normalization_7[0][0]   
                                                                 add_1[0][0]                      
__________________________________________________________________________________________________
reflection_padding2d_6 (Reflect (None, 66, 66, 128)  0           add_2[0][0]                      
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 64, 64, 128)  147584      reflection_padding2d_6[0][0]     
__________________________________________________________________________________________________
instance_normalization_8 (Insta (None, 64, 64, 128)  256         conv2d_8[0][0]                   
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 64, 64, 128)  0           instance_normalization_8[0][0]   
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 64, 64, 128)  0           activation_6[0][0]               
__________________________________________________________________________________________________
reflection_padding2d_7 (Reflect (None, 66, 66, 128)  0           dropout_3[0][0]                  
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 64, 64, 128)  147584      reflection_padding2d_7[0][0]     
__________________________________________________________________________________________________
instance_normalization_9 (Insta (None, 64, 64, 128)  256         conv2d_9[0][0]                   
__________________________________________________________________________________________________
add_3 (Add)                     (None, 64, 64, 128)  0           instance_normalization_9[0][0]   
                                                                 add_2[0][0]                      
__________________________________________________________________________________________________
reflection_padding2d_8 (Reflect (None, 66, 66, 128)  0           add_3[0][0]                      
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 64, 64, 128)  147584      reflection_padding2d_8[0][0]     
__________________________________________________________________________________________________
instance_normalization_10 (Inst (None, 64, 64, 128)  256         conv2d_10[0][0]                  
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 64, 64, 128)  0           instance_normalization_10[0][0]  
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 64, 64, 128)  0           activation_7[0][0]               
__________________________________________________________________________________________________
reflection_padding2d_9 (Reflect (None, 66, 66, 128)  0           dropout_4[0][0]                  
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 64, 64, 128)  147584      reflection_padding2d_9[0][0]     
__________________________________________________________________________________________________
instance_normalization_11 (Inst (None, 64, 64, 128)  256         conv2d_11[0][0]                  
__________________________________________________________________________________________________
add_4 (Add)                     (None, 64, 64, 128)  0           instance_normalization_11[0][0]  
                                                                 add_3[0][0]                      
__________________________________________________________________________________________________
reflection_padding2d_10 (Reflec (None, 66, 66, 128)  0           add_4[0][0]                      
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 64, 64, 128)  147584      reflection_padding2d_10[0][0]    
__________________________________________________________________________________________________
instance_normalization_12 (Inst (None, 64, 64, 128)  256         conv2d_12[0][0]                  
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 64, 64, 128)  0           instance_normalization_12[0][0]  
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 64, 64, 128)  0           activation_8[0][0]               
__________________________________________________________________________________________________
reflection_padding2d_11 (Reflec (None, 66, 66, 128)  0           dropout_5[0][0]                  
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 64, 64, 128)  147584      reflection_padding2d_11[0][0]    
__________________________________________________________________________________________________
instance_normalization_13 (Inst (None, 64, 64, 128)  256         conv2d_13[0][0]                  
__________________________________________________________________________________________________
add_5 (Add)                     (None, 64, 64, 128)  0           instance_normalization_13[0][0]  
                                                                 add_4[0][0]                      
__________________________________________________________________________________________________
reflection_padding2d_12 (Reflec (None, 66, 66, 128)  0           add_5[0][0]                      
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 64, 64, 128)  147584      reflection_padding2d_12[0][0]    
__________________________________________________________________________________________________
instance_normalization_14 (Inst (None, 64, 64, 128)  256         conv2d_14[0][0]                  
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 64, 64, 128)  0           instance_normalization_14[0][0]  
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, 64, 64, 128)  0           activation_9[0][0]               
__________________________________________________________________________________________________
reflection_padding2d_13 (Reflec (None, 66, 66, 128)  0           dropout_6[0][0]                  
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 64, 64, 128)  147584      reflection_padding2d_13[0][0]    
__________________________________________________________________________________________________
instance_normalization_15 (Inst (None, 64, 64, 128)  256         conv2d_15[0][0]                  
__________________________________________________________________________________________________
add_6 (Add)                     (None, 64, 64, 128)  0           instance_normalization_15[0][0]  
                                                                 add_5[0][0]                      
__________________________________________________________________________________________________
reflection_padding2d_14 (Reflec (None, 66, 66, 128)  0           add_6[0][0]                      
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 64, 64, 128)  147584      reflection_padding2d_14[0][0]    
__________________________________________________________________________________________________
instance_normalization_16 (Inst (None, 64, 64, 128)  256         conv2d_16[0][0]                  
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 64, 64, 128)  0           instance_normalization_16[0][0]  
__________________________________________________________________________________________________
dropout_7 (Dropout)             (None, 64, 64, 128)  0           activation_10[0][0]              
__________________________________________________________________________________________________
reflection_padding2d_15 (Reflec (None, 66, 66, 128)  0           dropout_7[0][0]                  
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 64, 64, 128)  147584      reflection_padding2d_15[0][0]    
__________________________________________________________________________________________________
instance_normalization_17 (Inst (None, 64, 64, 128)  256         conv2d_17[0][0]                  
__________________________________________________________________________________________________
add_7 (Add)                     (None, 64, 64, 128)  0           instance_normalization_17[0][0]  
                                                                 add_6[0][0]                      
__________________________________________________________________________________________________
reflection_padding2d_16 (Reflec (None, 66, 66, 128)  0           add_7[0][0]                      
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 64, 64, 128)  147584      reflection_padding2d_16[0][0]    
__________________________________________________________________________________________________
instance_normalization_18 (Inst (None, 64, 64, 128)  256         conv2d_18[0][0]                  
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 64, 64, 128)  0           instance_normalization_18[0][0]  
__________________________________________________________________________________________________
dropout_8 (Dropout)             (None, 64, 64, 128)  0           activation_11[0][0]              
__________________________________________________________________________________________________
reflection_padding2d_17 (Reflec (None, 66, 66, 128)  0           dropout_8[0][0]                  
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 64, 64, 128)  147584      reflection_padding2d_17[0][0]    
__________________________________________________________________________________________________
instance_normalization_19 (Inst (None, 64, 64, 128)  256         conv2d_19[0][0]                  
__________________________________________________________________________________________________
add_8 (Add)                     (None, 64, 64, 128)  0           instance_normalization_19[0][0]  
                                                                 add_7[0][0]                      
__________________________________________________________________________________________________
reflection_padding2d_18 (Reflec (None, 66, 66, 128)  0           add_8[0][0]                      
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 64, 64, 128)  147584      reflection_padding2d_18[0][0]    
__________________________________________________________________________________________________
instance_normalization_20 (Inst (None, 64, 64, 128)  256         conv2d_20[0][0]                  
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 64, 64, 128)  0           instance_normalization_20[0][0]  
__________________________________________________________________________________________________
dropout_9 (Dropout)             (None, 64, 64, 128)  0           activation_12[0][0]              
__________________________________________________________________________________________________
reflection_padding2d_19 (Reflec (None, 66, 66, 128)  0           dropout_9[0][0]                  
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 64, 64, 128)  147584      reflection_padding2d_19[0][0]    
__________________________________________________________________________________________________
instance_normalization_21 (Inst (None, 64, 64, 128)  256         conv2d_21[0][0]                  
__________________________________________________________________________________________________
add_9 (Add)                     (None, 64, 64, 128)  0           instance_normalization_21[0][0]  
                                                                 add_8[0][0]                      
__________________________________________________________________________________________________
reflection_padding2d_20 (Reflec (None, 66, 66, 128)  0           add_9[0][0]                      
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 64, 64, 128)  147584      reflection_padding2d_20[0][0]    
__________________________________________________________________________________________________
instance_normalization_22 (Inst (None, 64, 64, 128)  256         conv2d_22[0][0]                  
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 64, 64, 128)  0           instance_normalization_22[0][0]  
__________________________________________________________________________________________________
dropout_10 (Dropout)            (None, 64, 64, 128)  0           activation_13[0][0]              
__________________________________________________________________________________________________
reflection_padding2d_21 (Reflec (None, 66, 66, 128)  0           dropout_10[0][0]                 
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 64, 64, 128)  147584      reflection_padding2d_21[0][0]    
__________________________________________________________________________________________________
instance_normalization_23 (Inst (None, 64, 64, 128)  256         conv2d_23[0][0]                  
__________________________________________________________________________________________________
add_10 (Add)                    (None, 64, 64, 128)  0           instance_normalization_23[0][0]  
                                                                 add_9[0][0]                      
__________________________________________________________________________________________________
reflection_padding2d_22 (Reflec (None, 66, 66, 128)  0           add_10[0][0]                     
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 64, 64, 128)  147584      reflection_padding2d_22[0][0]    
__________________________________________________________________________________________________
instance_normalization_24 (Inst (None, 64, 64, 128)  256         conv2d_24[0][0]                  
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 64, 64, 128)  0           instance_normalization_24[0][0]  
__________________________________________________________________________________________________
dropout_11 (Dropout)            (None, 64, 64, 128)  0           activation_14[0][0]              
__________________________________________________________________________________________________
reflection_padding2d_23 (Reflec (None, 66, 66, 128)  0           dropout_11[0][0]                 
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 64, 64, 128)  147584      reflection_padding2d_23[0][0]    
__________________________________________________________________________________________________
instance_normalization_25 (Inst (None, 64, 64, 128)  256         conv2d_25[0][0]                  
__________________________________________________________________________________________________
add_11 (Add)                    (None, 64, 64, 128)  0           instance_normalization_25[0][0]  
                                                                 add_10[0][0]                     
__________________________________________________________________________________________________
reflection_padding2d_24 (Reflec (None, 66, 66, 128)  0           add_11[0][0]                     
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 64, 64, 128)  147584      reflection_padding2d_24[0][0]    
__________________________________________________________________________________________________
instance_normalization_26 (Inst (None, 64, 64, 128)  256         conv2d_26[0][0]                  
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 64, 64, 128)  0           instance_normalization_26[0][0]  
__________________________________________________________________________________________________
dropout_12 (Dropout)            (None, 64, 64, 128)  0           activation_15[0][0]              
__________________________________________________________________________________________________
reflection_padding2d_25 (Reflec (None, 66, 66, 128)  0           dropout_12[0][0]                 
__________________________________________________________________________________________________
conv2d_27 (Conv2D)              (None, 64, 64, 128)  147584      reflection_padding2d_25[0][0]    
__________________________________________________________________________________________________
instance_normalization_27 (Inst (None, 64, 64, 128)  256         conv2d_27[0][0]                  
__________________________________________________________________________________________________
add_12 (Add)                    (None, 64, 64, 128)  0           instance_normalization_27[0][0]  
                                                                 add_11[0][0]                     
__________________________________________________________________________________________________
conv2d_transpose_1 (Conv2DTrans (None, 128, 128, 64) 73792       add_12[0][0]                     
__________________________________________________________________________________________________
instance_normalization_28 (Inst (None, 128, 128, 64) 128         conv2d_transpose_1[0][0]         
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 128, 128, 64) 0           instance_normalization_28[0][0]  
__________________________________________________________________________________________________
conv2d_transpose_2 (Conv2DTrans (None, 256, 256, 32) 18464       activation_16[0][0]              
__________________________________________________________________________________________________
instance_normalization_29 (Inst (None, 256, 256, 32) 64          conv2d_transpose_2[0][0]         
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 256, 256, 32) 0           instance_normalization_29[0][0]  
__________________________________________________________________________________________________
reflection_padding2d_26 (Reflec (None, 262, 262, 32) 0           activation_17[0][0]              
__________________________________________________________________________________________________
conv2d_28 (Conv2D)              (None, 256, 256, 1)  1569        reflection_padding2d_26[0][0]    
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 256, 256, 1)  0           conv2d_28[0][0]                  
==================================================================================================
Total params: 3,736,577
Trainable params: 3,736,577
Non-trainable params: 0
__________________________________________________________________________________________________
